<a href="https://colab.research.google.com/github/Linda-Agesa/MTIU/blob/master/2Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Linda_Agesa_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**MTN Tech-Infra Ugrade Analysis**

Currently MTN Cote d'Ivoire would like to upgrade its technology infrastructure for its mobile users in Ivory Coast. Studying the given dataset, how does MTN Cote d'Ivoire go about the upgrade of its infrastructure strategy within the given cities?

The telecom data provided for this project is only a sample ( i.e. for only three days). The data files that you will need for this project will be as follows:

1.cells_geo_description.xlsx [Link] (Links to an external site.)

2.cells_geo.csv [Link] (Links to an external site.)

3.CDR_description.xlsx [Link] (Links to an external site.)

4.CDR 20120507 [http://bit.ly/TelecomDataset1] (Links to an external site.)

5.CDR 20120508 [http://bit.ly/TelecomDataset2] (Links to an external site.)

6.CDR 20120509 [http://bit.ly/TelecomDataset3]

# **Loading Our Libraries and Files**

In [0]:
import pandas as pd
import numpy as np

In [3]:
#Loading the datasets onto our environment
#This DataFrame gives a decription on the information on the cells_geo dataset

description_cg = pd.read_excel('cells_geo_description.xlsx')
description_cg

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [4]:
#This DataFrame gives a description of the information on the CDR files

description_cdr = pd.read_excel('CDR_description.xlsx')
description_cdr

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [2]:
#Loading the cells_geo csv file onto the environment

geo_df = pd.read_csv('cells_geo.csv', delimiter = ';')
geo_df.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [3]:
#read the day 1 dataset onto our environment, iterating through the dataset to get a sample of the dataset.
day1 = pd.read_csv('http://bit.ly/TelecomDataset1', iterator = True)

telecom_day1 = day1.get_chunk(1000000)
telecom_day1.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [4]:
#loading the day 2 data to our environment, use an iterator to and pick a sample of the entire dataset
day2 = pd.read_csv('http://bit.ly/TelecomDataset2', iterator = True )

telecom_day2 = day2.get_chunk(1000000)
telecom_day2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [5]:
#loading the day 2 data to our environment
day3 = pd.read_csv('http://bit.ly/TelecomDataset3', iterator = True)

telecom_day3 = day3.get_chunk(1000000)
telecom_day3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

# **Data Cleaning**

In [8]:
# We start by getting rid of the data that is not useful in our analysis from our DataFrames.
# The columns that remain are the ones that we are going to work with.

#First we rename the last column from SITE_CODE TO SITE_ID
geo_df.rename(columns = {'SIET_ID' : 'SITE_ID'}, inplace = True)

# From the Cells_geo DataFrame we will drop the following columns: UNNAMED, DECOUPZONE, ZONENAME, LONGITUDE, LATITUDE, REGION ,AREA
new_geo = geo_df.drop(['Unnamed: 0', 'DECOUPZONE', 'ZONENAME', 'LONGITUDE', 'LATITUDE', 'REGION', 'AREA'], axis = 1)
new_geo.head()

    VILLES      STATUS LOCALISATION     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  7a1029d2ab  8a1e6ce31f

In [0]:
#renaming the first column from PRODUTC TO PRODUCT and the DATETIME column to DATE_TIME
telecom_day1.rename(columns= {'PRODUTC' : 'PRODUCT', 'DATETIME' : 'DATE_TIME'}, inplace = True)

#Dropping unnecessary columns from the day 1 dataset

telecom_day1 =telecom_day1.drop(['CELL_ON_SITE', 'DW_A_NUMBER_INT',	'DW_B_NUMBER_INT', 'COUNTRY_A',	'COUNTRY_B'], axis = 1)

In [10]:
#Display day 1 DataFrame
telecom_day1.tail()

       PRODUCT  VALUE              DATE_TIME     CELL_ID     SITE_ID
999995     sms      0  2012-05-07 07:24:54.0  68b27f9849  c996f2949a
999996   Voice     64  2012-05-07 07:24:54.0  c81af4d7e5  0449817786
999997   Voice     23  2012-05-07 07:24:54.0  0bb30f4eb8  7ee1a1444f
999998   Voice    140  2012-05-07 07:24:54.0  cc71f76b42  db11cc9f85
999999   Voice     13  2012-05-07 07:24:54.0  fc91429329  a38efdcc21

In [11]:
#Dropping irrelevant columns in the day 2 DataFrame

telecom_day2 = telecom_day2.drop(['CELL_ON_SITE', 'DW_A_NUMBER',	'DW_B_NUMBER', 'COUNTRY_A',	'COUNTRY_B'], axis = 1)
telecom_day2.head()

  PRODUCT  VALUE              DATE_TIME     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  +bO+qkSonO  +bO+qkSonO

In [12]:
#Renaming the last column from SIET_ID TO SITE_ID
telecom_day3.rename(columns = {'SIET_ID' : 'SITE_ID'}, inplace = True)

# Dropping the columns that are not needed in the day 3 DataFrame
telecom_day3 = telecom_day3.drop(['CELL_ON_SITE', 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT', 'COUNTRY_A','COUNTRY_B'], axis = 1)
telecom_day3.head()

  PRODUCT  VALUE              DATE_TIME      CELLID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  /eeMklgyJA  /eeMklgyJA

In [13]:
#renaming the CELLID column to CELL_ID
telecom_day3.rename(columns= {'CELLID' : 'CELL_ID'}, inplace = True)

telecom_day3.head()

  PRODUCT  VALUE              DATE_TIME     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  /eeMklgyJA  /eeMklgyJA

In [14]:
# Next we check for missing data in our datasets

# Checking for null values in the cells_geo dataset
np.count_nonzero(geo_df.isnull())

96

In [15]:
#Checking the rows and columns in our new_geo dataframe

new_geo.shape

(3974, 5)

In [16]:
#dropping rows with null values from the new_geo dataframe and checking the shape after dropping the rows

new_geo.dropna().shape

(3907, 5)

In [18]:
#Checking for null values in the day 1 DataFrame

np.count_nonzero(telecom_day1.isnull())

89602

In [19]:
#Checking for missing values in the day 2 dataframe

np.count_nonzero(telecom_day2.isnull())

77198

In [20]:
#checking for missing values in the day 3 dataframe

np.count_nonzero(telecom_day3.isnull())

88359

In [21]:
#checking the datatypes of our day 1 dataset variables
telecom_day1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 5 columns):
PRODUCT      1000000 non-null object
VALUE        1000000 non-null int64
DATE_TIME    1000000 non-null object
CELL_ID      1000000 non-null object
SITE_ID      910398 non-null object
dtypes: int64(1), object(4)
memory usage: 38.1+ MB

In [22]:
#Lets change the format of the DATE_TIME column
pd.to_datetime(telecom_day1['DATE_TIME']).head()

0   2012-05-06 23:04:37
1   2012-05-06 23:05:25
2   2012-05-06 23:05:41
3   2012-05-06 23:05:42
4   2012-05-06 23:06:29
Name: DATE_TIME, dtype: datetime64[ns]

In [23]:
# Next we will split the DATE_TIME column into separate Date and Time columns

#tel_day1['Time'] = pd.to_datetime(tel_day1.ime)
#tel_day1['Date'] = pd.datetime(tel_day1.Time)
telecom_day1[['DATE', 'TIME']] = telecom_day1['DATE_TIME'].str.split(" ", 1, expand = True)
telecom_day1.drop('DATE_TIME', axis = 1)

telecom_day1.head()

  PRODUCT  VALUE              DATE_TIME  ...     SITE_ID        DATE        TIME
0   Voice      0  2012-05-06 23:04:37.0  ...  /TJNe+Mmtu  2012-05-06  23:04:37.0
1     sms      0  2012-05-06 23:05:25.0  ...  /+cKZKIp41  2012-05-06  23:05:25.0
2     sms     25  2012-05-06 23:05:41.0  ...  /u0FSD+ahi  2012-05-06  23:05:41.0
3   Voice     56  2012-05-06 23:05:42.0  ...  +cNeJzsTp3  2012-05-06  23:05:42.0
4   Voice     14  2012-05-06 23:06:29.0  ...  051KhYDCpv  2012-05-06  23:06:29.0

[5 rows x 7 columns]

In [24]:
#Lets change the format of the DATE and TIME columns
print(pd.to_datetime(telecom_day1['DATE']).head())
print(pd.to_datetime(telecom_day1['TIME']).head())

0   2012-05-06
1   2012-05-06
2   2012-05-06
3   2012-05-06
4   2012-05-06
Name: DATE, dtype: datetime64[ns]
0   2019-07-12 23:04:37
1   2019-07-12 23:05:25
2   2019-07-12 23:05:41
3   2019-07-12 23:05:42
4   2019-07-12 23:06:29
Name: TIME, dtype: datetime64[ns]

In [25]:
#Checking the info of the day 2 dataset
telecom_day2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 5 columns):
PRODUCT      1000000 non-null object
VALUE        1000000 non-null int64
DATE_TIME    1000000 non-null object
CELL_ID      1000000 non-null object
SITE_ID      922802 non-null object
dtypes: int64(1), object(4)
memory usage: 38.1+ MB

In [26]:
#Changing the format of the DATE_TIME column in the day 2 dataframe
pd.to_datetime(telecom_day1['DATE_TIME']).head()

0   2012-05-06 23:04:37
1   2012-05-06 23:05:25
2   2012-05-06 23:05:41
3   2012-05-06 23:05:42
4   2012-05-06 23:06:29
Name: DATE_TIME, dtype: datetime64[ns]

In [27]:
#splitting the DATE_TIME Column
telecom_day2[['DATE', 'TIME']] = telecom_day2['DATE_TIME'].str.split(" ", 1, expand = True)
telecom_day2.head()

  PRODUCT  VALUE              DATE_TIME  ...     SITE_ID        DATE        TIME
0     sms      0  2012-05-07 23:02:06.0  ...  +854AcBQT2  2012-05-07  23:02:06.0
1   Voice      0  2012-05-07 23:03:44.0  ...  +854AcBQT2  2012-05-07  23:03:44.0
2     sms      0  2012-05-07 23:04:06.0  ...  +laSrk7g6q  2012-05-07  23:04:06.0
3   Voice     37  2012-05-07 23:04:48.0  ...  /xvRrCVKoQ  2012-05-07  23:04:48.0
4     sms     25  2012-05-07 23:04:58.0  ...  +bO+qkSonO  2012-05-07  23:04:58.0

[5 rows x 7 columns]

In [28]:
#Lets change the format of the DATE and TIME columns
print(pd.to_datetime(telecom_day2['DATE']).head())
print(pd.to_datetime(telecom_day2['TIME']).head())

0   2012-05-07
1   2012-05-07
2   2012-05-07
3   2012-05-07
4   2012-05-07
Name: DATE, dtype: datetime64[ns]
0   2019-07-12 23:02:06
1   2019-07-12 23:03:44
2   2019-07-12 23:04:06
3   2019-07-12 23:04:48
4   2019-07-12 23:04:58
Name: TIME, dtype: datetime64[ns]

In [29]:
#checking the datatypes of the day 3 dataset

telecom_day3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 5 columns):
PRODUCT      1000000 non-null object
VALUE        1000000 non-null int64
DATE_TIME    1000000 non-null object
CELL_ID      1000000 non-null object
SITE_ID      911641 non-null object
dtypes: int64(1), object(4)
memory usage: 38.1+ MB

In [30]:
#Changing the format of the DATE_TIME column on the day 3 dataset
pd.to_datetime(telecom_day3['DATE_TIME']).head()

0   2012-05-08 23:01:28
1   2012-05-08 23:01:31
2   2012-05-08 23:02:59
3   2012-05-08 23:03:04
4   2012-05-08 23:03:16
Name: DATE_TIME, dtype: datetime64[ns]

In [31]:
#splitting the date and time columns
telecom_day3[['DATE', 'TIME']] = telecom_day3['DATE_TIME'].str.split(" ", 1, expand = True)
telecom_day3.head()

  PRODUCT  VALUE              DATE_TIME  ...     SITE_ID        DATE        TIME
0   Voice     61  2012-05-08 23:01:28.0  ...  +38u2u/rfx  2012-05-08  23:01:28.0
1     sms      0  2012-05-08 23:01:31.0  ...  +Fs4mTvdKx  2012-05-08  23:01:31.0
2   Voice     10  2012-05-08 23:02:59.0  ...  +ZaaZozy/+  2012-05-08  23:02:59.0
3     sms      0  2012-05-08 23:03:04.0  ...  +cNeJzsTp3  2012-05-08  23:03:04.0
4   Voice     22  2012-05-08 23:03:16.0  ...  /eeMklgyJA  2012-05-08  23:03:16.0

[5 rows x 7 columns]

In [32]:
#Changing the format of the DATE and TIME columns
print(pd.to_datetime(telecom_day3['DATE']).head())
print(pd.to_datetime(telecom_day3['TIME']).head())

0   2012-05-08
1   2012-05-08
2   2012-05-08
3   2012-05-08
4   2012-05-08
Name: DATE, dtype: datetime64[ns]
0   2019-07-12 23:01:28
1   2019-07-12 23:01:31
2   2019-07-12 23:02:59
3   2019-07-12 23:03:04
4   2019-07-12 23:03:16
Name: TIME, dtype: datetime64[ns]

In [33]:
# We integrate the datasets by concatenating the three days datasets using the concat() fuction.

combined_df = pd.concat([telecom_day1, telecom_day2, telecom_day3], keys= ['x','y','z'], sort = True)

combined_df.head()

        CELL_ID        DATE  ...        TIME VALUE
x 0  /TJNe+Mmtu  2012-05-06  ...  23:04:37.0     0
  1  /+cKZKIp41  2012-05-06  ...  23:05:25.0     0
  2  /u0FSD+ahi  2012-05-06  ...  23:05:41.0    25
  3  +cNeJzsTp3  2012-05-06  ...  23:05:42.0    56
  4  051KhYDCpv  2012-05-06  ...  23:06:29.0    14

[5 rows x 7 columns]

In [35]:
# Now we merge our combined DataFrame with the cells_geo DataFrame

comprehende_df = combined_df.merge(new_geo, how='inner',left_on='CELL_ID', right_on = 'SITE_CODE')
comprehende_df

     CELL_ID_x        DATE  ...   CELL_ID_y   SITE_CODE
0   7d41b1e068  2012-05-08  ...  73611f7b1e  7d41b1e068
1   7d41b1e068  2012-05-08  ...  3dddf304b3  7d41b1e068
2   7d41b1e068  2012-05-08  ...  d0692f1086  7d41b1e068
3   7d41b1e068  2012-05-08  ...  73611f7b1e  7d41b1e068
4   7d41b1e068  2012-05-08  ...  3dddf304b3  7d41b1e068
5   7d41b1e068  2012-05-08  ...  d0692f1086  7d41b1e068
6   7d41b1e068  2012-05-08  ...  73611f7b1e  7d41b1e068
7   7d41b1e068  2012-05-08  ...  3dddf304b3  7d41b1e068
8   7d41b1e068  2012-05-08  ...  d0692f1086  7d41b1e068
9   7d41b1e068  2012-05-08  ...  73611f7b1e  7d41b1e068
10  7d41b1e068  2012-05-08  ...  3dddf304b3  7d41b1e068
11  7d41b1e068  2012-05-08  ...  d0692f1086  7d41b1e068
12  7d41b1e068  2012-05-08  ...  73611f7b1e  7d41b1e068
13  7d41b1e068  2012-05-08  ...  3dddf304b3  7d41b1e068
14  7d41b1e068  2012-05-08  ...  d0692f1086  7d41b1e068
15  70cb7af111  2012-05-09  ...  7528294781  70cb7af111
16  70cb7af111  2012-05-09  ...  b1a456e48c  70cb7af111
17  70cb7af111  2012-05-09  ...  5ee970ecd8  70cb7af111

[18 rows x 12 columns]

# Data Analysis

In [38]:
# We use a pivot table to compare the products and the revenue they generate, and the price per unit

pd.pivot_table(combined_df, index = ['PRODUCT'], values = ['VALUE'],aggfunc =[np.sum, np.mean])

              sum       mean
            VALUE      VALUE
PRODUCT
Voice    71301725  51.839400
data       908457   3.555967
sms       2609835   1.906254

In [48]:
#Next we will determine the city with the highest frequency of users

new_geo.groupby(['VILLES'])['STATUS'].count().sort_values(ascending = False).head(20)

VILLES
COCODY          354
YOPOUGON        289
ABOBO           250
MARCORY         141
TREICHVILLE     132
ADJAME          109
YAMOUSSOUKRO    104
PLATEAU         103
KOUMASSI         91
BOUAKE           65
PORT-BOUET       59
DALOA            59
SAN-PEDRO        55
GAGNOA           55
ATTECOUBE        45
DIVO             36
KORHOGO          32
BINGERVILLE      30
SOUBRE           28
GUIGLO           27
Name: STATUS, dtype: int64

In [50]:
#from the cells geo dataframe lets determine the localization of the majority of users

geo_df.groupby(['LOCALISATION'])['VILLES'].count()

LOCALISATION
ABIDJAN      1669
INTERIEUR    2305
Name: VILLES, dtype: int64